nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f83000evk/driver_examples/queued_spi/edma_b2b_transfer/master/pin_mux.h
/*
 * Copyright 2020-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name GPIOC0 (number 3), Y1[1]/EXTAL
  @{ */
#define BOARD_EXTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_EXTAL_PIN 0U              /*!<@brief GPIOC pin index: 0 */
#define BOARD_EXTAL_PIN_MASK kGPIO_Pin0 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOC1 (number 4), Y1[3]/XTAL
  @{ */
#define BOARD_XTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_XTAL_PIN 1U              /*!<@brief GPIOC pin index: 1 */
#define BOARD_XTAL_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOD6 (number 9), U14C[9]/TXD_BDM
  @{ */
#define BOARD_TXD_BDM_GPIO GPIOD          /*!<@brief GPIO device name: GPIOD */
#define BOARD_TXD_BDM_PIN 6U              /*!<@brief GPIOD pin index: 6 */
#define BOARD_TXD_BDM_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name GPIOD5 (number 10), U13[3]/RXD_BDM
  @{ */
#define BOARD_RXD_BDM_GPIO GPIOD          /*!<@brief GPIO device name: GPIOD */
#define BOARD_RXD_BDM_PIN 5U              /*!<@brief GPIOD pin index: 5 */
#define BOARD_RXD_BDM_PIN_MASK kGPIO_Pin5 /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name GPIOC8 (number 52), J2[10]/MISO0
  @{ */
#define BOARD_MISO0_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_MISO0_PIN 8U              /*!<@brief GPIOC pin index: 8 */
#define BOARD_MISO0_PIN_MASK kGPIO_Pin8 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOC10 (number 54), J2[8]/MOSI0
  @{ */
#define BOARD_MOSI0_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BOARD_MOSI0_PIN 10U              /*!<@brief GPIOC pin index: 10 */
#define BOARD_MOSI0_PIN_MASK kGPIO_Pin10 /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name GPIOC7 (number 50), J2[6]/SS0
  @{ */
#define BOARD_SS0_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_SS0_PIN 7U              /*!<@brief GPIOC pin index: 7 */
#define BOARD_SS0_PIN_MASK kGPIO_Pin7 /*!<@brief PORT pin mask */
                                      /* @} */

/*! @name GPIOC9 (number 53), J2[12]/SCK0
  @{ */
#define BOARD_SCK0_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_SCK0_PIN 9U              /*!<@brief GPIOC pin index: 9 */
#define BOARD_SCK0_PIN_MASK kGPIO_Pin9 /*!<@brief PORT pin mask */
                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
